app/views/comments/_comment.html.erb


 <%= comment.description %> - <%= time_tag comment.created_at, "data-local": "time-ago" %>
---
INSERT INTO "comments" ("project_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["description", "first comment"], ["created_at", "2023-03-27 17:07:54.567264"], ["updated_at", "2023-03-27 17:07:54.567264"]]