app/views/projects/_project.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."project_id" = ?  [["project_id", 1]]
---
  <p>
    <strong><%= pluralize project.comments.count, "comment" %></strong>