app/controllers/comments_controller.rb

	def create
 		comment = @project.comments.create params.required(:comment).permit(:description)
---
INSERT INTO "comments" ("project_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 1], ["description", "first comment"], ["created_at", "2023-03-27 17:07:54.567264"], ["updated_at", "2023-03-27 17:07:54.567264"]]