app/controllers/pages_controller.rb

SELECT "projects".* FROM "projects"
---
  def home
      @projects = Project.all

SELECT "projects".* FROM "projects"
---
  def show
      @projects = Project.all