app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "completion_status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Building house"], ["completion_status", 0], ["created_at", "2023-03-27 15:27:03.968304"], ["updated_at", "2023-03-27 15:27:03.968304"]]